<!DOCTYPE html>
<html lang="en" dir="ltr">
  <head>
    <meta charset="utf-8">
    <title>Εκτύπωση</title>
    <!-- CSS Stylesheets -->

    <link rel="stylesheet" href="css/styles.css">

  </head>
  <body>

    <?php
    require 'phpFiles/connectDB.php';
    session_start();
    //Εισαγωγή δεδομένων από την φόρμα
    $kod_trapez = $_SESSION['kod_trapez'];
    $afm = $_SESSION['afm'];

    $question = "SELECT * FROM pagies WHERE afm = $afm";
    $result = $mysqli -> query($question);
    while ($row = $result->fetch_assoc()) {
        $eponimo=$row['eponimo'];
        $onoma=$row['onoma'];
        $patronimo=$row['patronimo'];
        $koinotita=$row['koinotita'];
        $dieythinsi=$row['dieythinsi'];
        $kod_trapez=$row['kod_trapez'];
        $iban=$row['iban'];
        $adt=$row['adt'];
        $stathero=$row['stathero'];
        $kinito=$row['kinito'];
        $trapeza=$row['trapeza'];
        $email=$row['email'];

    }

    if ($kod_trapez == "017") { //Εάν Πειραώς
                ?>

<div class="selida">

<h4><strong>ΠΡΟΣ</strong><br />
<strong>ΤΡΑΠΕΖΑ ΠΕΙΡΑΙΩΣ Α.Ε.</strong></h4>

<h4 class="epikefalida"><strong>ΠΑΓΙΑ ΕΝΤΟΛΗ <br />
ΕΞΟΦΛΗΣΗ ΟΦΕΙΛΩΝ</strong></h4>

<div class="pinakas">
  <h4 class="epikefalida">ΣΤΟΙΧΕΙΑ ΚΑΤΑΘΕΤΗ</h4>
</div>

<br>
<table class="pinakas">
  <tr class="onomatep">
    <td><h5>  Ονοματεπώνυμο</h5></td>
    <td><h5><?php echo $eponimo; echo " "; echo $onoma; ?></h5></td>
  </tr>

  <tr class="grammi">
    <td><h5>Πατρώνυμο</h5></td>
    <td><h5><?php echo $patronimo; ?></h5></td>
  </tr>
</table>
<br />
<table class="pinakas">
  <tr class="grammi">
    <td><h5>Αριθμός Α.Δ.Τ</h5></td>
    <td><h5><?php echo $adt; ?></h5></td>
    <td><h5>Αρχή Έκδοσης</h5></td>
    <td><h5></h5></td>
  </tr>

  <tr class="grammi">
    <td><h5>Α.Φ.Μ.</h5></td>
    <td><h5><?php echo $afm; ?></h5></td>
    <td><h5>Δ.Ο.Υ.</h5></td>
    <td><h5>Κιλκίς</h5></td>
  </tr>
</table>
<br />
<table class="pinakas">

  <tr class="grammi">
    <td><h5>Τηλέφωνα Επικοινωνίας</h5></td>
    <td><h5><?php echo $stathero; echo " "; echo $kinito; ?></h5></td>
  </tr>


</table>

<div class="keimeno">
  <p>Ο υπογράφων την παρούσα σας δηλώνω ότι επιθυμώ την εξόφληση των οικονομικών υποχρεώσεών μου προς την ΑΓΡΟΤΙΚΗ ΕΤΑΙΡΙΚΗ ΣΥΜΠΡΑΞΗ ΘΕΣΣΑΛΟΝΙΚΗΣ Α.Ε όπως αυτές διαμορφώνονται στα αρχεία της Προς τον σκοπό αυτό, παρέχω τη ρητή εντολή και εξουσιοδότησή μου προς την Τράπεζά σας να εξοφλεί για λογαριασμό μου αυτές τις υποχρεώσεις μου με χρέωση του λογαριασμού μου, με IBAN <strong><?php echo $iban; ?></strong> με τα ποσά που θα κοινοποιούνται εγγράφως εκάστοτε στην Τράπεζά σας από την ΑΕΣΘ Α.Ε</p>
  <p>
    Η παρούσα εντολή και εξουσιοδότησή μου, ισχύει και στις περιπτώσεις των άρθρων 223 και 726 Α.Κ., θα πάψει δε  να ισχύει  την επόμενη εργάσιμη ημέρα από την έγγραφη κοινοποίηση της ανάκλησης της προς την Τράπεζα, και με την προϋπόθεση ότι η εντολή δεν έχει εκτελεσθεί ολικώς ή εν μέρει.
  </p>
  <p>
    Επιπλέον δηλώνω ότι αποδέχομαι ανεπιφύλακτα τους όρους που αναγράφονται παρακάτω.
  </p>
</div>

<div class="ypografes">
  <h4 class="entoleas">Ο ΕΝΤΟΛΕΑΣ</h4>
  <h4 class="hmerominia">Ημερομηνία:</h4>
  <h4>Υπογραφή</h4>

<br />

<h3>______________</h3>
<p>
  (τίθεται θεώρηση γνησίου της υπογραφής)
</p>
</div>

<div class="oroi">
  <h4 class="oroi_pagias">Όροι πάγιας εντολής εξόφλησης οφειλών</h4>
  <ul>
    <li>Σε περίπτωση μη εμπρόθεσμης εξόφλησης των οφειλών, ο/η ΑΕΣΘ Α.Ε θα μπορεί να επιδιώκει την είσπραξή του κατά τα ισχύοντα.</li>
    <li>Ο/Η ΑΕΣΘ Α.Ε  μπορεί να αναστείλει, προσωρινά ή οριστικά, την μέσω του συστήματος εξόφληση των οφειλών, αν το κρίνει αναγκαίο και να απαιτήσει την είσπραξή τους με άλλο τρόπο.</li>
    <li>Οι χρεούμενοι τραπεζικοί λογαριασμοί θα πρέπει να έχουν επαρκές διαθέσιμο υπόλοιπο κατά την ημερομηνία εξόφλησης της οφειλής. </li>
    <li>Η Τράπεζα δεν φέρει καμία ευθύνη έναντι του εντολέα - καταθέτη, του οποίου η πληρωμή, για οποιονδήποτε λόγο, δεν πραγματοποιήθηκε</li>
  </ul>


</div>

</div>





<?php
    }
    else if($kod_trapez == "011"){ //Εάν Εθνική
      ?>


      <div class="selida2">

      <h5 class="mple"><br />
      <strong><u>ΠΑΓΙΑ ΕΝΤΟΛΗ ΠΛΗΡΩΜΗΣ ΛΟΓΑΡΙΑΣΜΩΝ ΟΦΕΙΛΩΝ ΜΕΣΩ ΤΡΑΠΕΖΙΚΟΥ ΛΟΓΑΡΙΑΣΜΟΥ</u></strong></h5>

      <h5 class="mple"><strong>ΣΤΟΙΧΕΙΑ ΠΕΛΑΤΗ</strong></h5>
      <h5 >Ονοματεπώνυμο/Επωνυμία : <?php echo " "; echo $eponimo; echo " "; echo $onoma; ?></h5>
      <h5 >Κοινότητα : <?php echo " "; echo $koinotita; ?></h5>
      <h5 >Διεύθυνση : <?php echo " "; echo $dieythinsi; ?></h5>
      <h5 >ΑΦΜ : <?php echo " "; echo $afm;  ?></h5>
      <h5 >Αριθμός Ταυτότητας : <?php echo " "; echo $adt;  ?></h5>
      <h5 >Δ.Ο.Υ. : Κιλκίς </h5>
      <h5 >Τηλέφωνο : <?php echo " "; echo $stathero; echo " "; echo $kinito; ?></h5>
      <h5 >Email : <?php echo " "; echo $email; ?></h5>

      <h5 class="mple"><strong>ΣΤΟΙΧΕΙΑ ΤΡΑΠΕΖΙΚΟΥ ΛΟΓΑΡΙΑΣΜΟΥ-ΕΝΤΟΛΕΑ: </strong></h5>
      <h5 >Ονοματεπώνυμο/Επωνυμία Δικαιούχου: <?php echo " "; echo $eponimo; echo " "; echo $onoma; ?></h5>
      <h5 >Τράπεζα : <?php echo " "; echo $trapeza; ?></h5>
      <h5 >IBAN : <?php echo " "; echo $iban; ?></h5>
      <h5 class="mple"><strong>ΚΩΔΙΚΟΣ ΑΝΑΘΕΣΗΣ ΠΑΓΙΑΣ ΕΝΤΟΛΗΣ: </strong></h5>



      <div class="epikefalida2">
        <h5 class="epikefalida">ΑΠΟΔΟΧΗ ΟΡΩΝ ΕΝΤΟΛΕΑ</h5>
        <p>Με την παρούσα εξουσιοδοτώ τον Φορέα Υποδοχής Ενιαίας Αίτησης Ενίσχυσης ΑΓΡΟΤΙΚΗ ΕΤΑΙΡΙΚΗ ΣΥΜΠΡΑΞΗ ΘΕΣΣΑΛΟΝΙΚΗΣ Α.Ε να αποστέλλει οδηγίες στην τράπεζά μου για χρέωση του λογαριασμού μου και αντιστοίχως την τράπεζά μου να χρεώνει τον λογαριασμό μου, σύμφωνα με τις οδηγίες που λαμβάνει από την τον Φορέα ΑΕΣΘ Α.Ε  Ακολούθως, αναγνωρίζω και αποδέχομαι όλες οι χρεώσεις από οφειλές προς τον Φορέα  να χρεώνονται και να εξοφλούνται μέσω του παραπάνω δηλούμενου λογαριασμού, για όλη την περίοδο ισχύος του (όπως εκάστοτε ανανεώνεται) και εξουσιοδοτώ την ως άνω τράπεζα να τις εξοφλεί. Οι όροι με τους οποίους θα γίνονται οι χρεώσεις περιλαμβάνουν τους πιο κάτω ουσιώδεις όρους τους οποίους και αποδέχομαι:</p>
        <p>
        α) Για την επιτυχή εκτέλεση της πάγιας εντολής θα πρέπει ο χρεούμενος τραπεζικός λογαριασμός να έχει επαρκές διαθέσιμο υπόλοιπο κατά την ημερομηνία που αποστέλλεται αρχείο χρεώσεων του Φορέα προς την Τράπεζα προς εκτέλεση. Σε περίπτωση μη ύπαρξης επαρκούς προς τούτο υπολοίπου, κατά την ως άνω ημερομηνία εξουσιοδοτώ την Τράπεζα να χρεώνει τον δηλωθέντα λογαριασμό μέχρι του ύψους του διαθεσίμου υπολοίπου του και σε κάθε περίπτωση μέχρι του ποσού που αιτείται ο Φορέας για την εξόφληση όσο δυνατόν μεγαλύτερου μέρους της οφειλής.</p>
        <p>
          β) Ο Πελάτης διατηρεί το δικαίωμα να ανακαλέσει την εντολή εγγράφως.  Η παρούσα παύει να ισχύει στην περίπτωση που γνωστοποιηθεί εγγράφως από τον Φορέα στην τράπεζα ανάκληση της εντολής ή θάνατος του πελάτη ή άλλος νόμιμος λόγος λύσης της εντολής. <br />
Με την παρούσα αποδέχομαι και συναινώ, επίσης, στην επεξεργασία των προσωπικών μου δεδομένων από την Φορέα, στο πλαίσιο της εκτέλεσης της πάγιας εντολής για την εξόφληση των οφειλών   μου προς αυτόν μέσω τραπεζικού λογαριασμού.
Σύμφωνα με τους όρους και τις προϋποθέσεις της συμφωνίας μεταξύ της Τράπεζάς σας και του Φορέα, δικαιούμαι  να απαιτήσω την επιστροφή ποσού από την τράπεζά σας εντός 8 εβδομάδων από την ημερομηνία χρέωσης του λογαριασμού μου.

        </p>
      </div>





      <div class="row">
        <div class="column">
          <h5 >ΗΜΕΡΟΜΗΝΙΑ</h5>
          <br />
          <h5 >.............................</h5>
        </div>
        <div class="column">
          <h6 >Ο ΕΝΤΟΛΕΑΣ-  ΔΙΚΑΙΟΥΧΟΣ ΛΟΓΑΡΙΑΣΜΟΥ</h6>
          <br />
          <h5 >.....................................................</h5>
        </div>
        <div class="column deksia">
          <h5 >ΤΟΝ ΦΟΡΕΑ</h5>
          <br />
          <h5 >.....................................................</h5>
        </div>
      </div>


        </div>






      <?php
    }

    else { // Εάν δεν υπάρχει ο κωδικός τραπέζης
      echo   '<script language="javascript" type="text/javascript">
      if (!alert ("Δεν εκδίδεται πάγια εντολή για την τράπεζα του παραγωγού.")) {
          location.href = "index.php";
        }
                                </script>';
    }
?>


  </body>
</html>
